<p style ="text-align:center">
    <img src="http://epecora.com.br/DataFiles/PPGOLD_PPGMNE.png" width="700" alt="PPGOLD Data Science: INTRO"  />
</p>

* Aluno: Miguel Zanchettin de Oliveira
* Programa: PPGMNE UPFR

# Aula 02: Data Science 1
## PANDAS - Tarefa

In [1]:
import pandas as pd
import numpy as np

In [2]:
pd.__version__

'2.2.2'

## Crie Series a partir das listas

In [3]:
lista_1 = [10, 20, 30, 40, 50, 60]

In [4]:
# Criando uma Series a partir de uma lista
pd.Series(lista_1)

0    10
1    20
2    30
3    40
4    50
5    60
dtype: int64

In [7]:
frutas = ["Banana","Maçã","Goiaba","Melão","Mamão","Acerola"]

In [8]:
# Serie das Frutas
pd.Series(frutas)

0     Banana
1       Maçã
2     Goiaba
3      Melão
4      Mamão
5    Acerola
dtype: object

## Crie um DATA FRAME a partir das duas séries anteriores

TIP: `concat`

In [15]:
# Responda Aqui
pd.concat([pd.Series(frutas), pd.Series(lista_1)], axis=1)

         0   1
0   Banana  10
1     Maçã  20
2   Goiaba  30
3    Melão  40
4    Mamão  50
5  Acerola  60

# Crie um DataFrame a partir do dicionário

In [16]:
# Criando um DataFrame a partir de um dicionário
data = {'Nome': ['Alice', 'Bob', 'Charlie', 'David'],
        'Idade': [25, 30, 35, 40],
        'Cidade': ['São Paulo', 'Rio de Janeiro', 'Belo Horizonte', 'Curitiba']}
data

{'Nome': ['Alice', 'Bob', 'Charlie', 'David'],
 'Idade': [25, 30, 35, 40],
 'Cidade': ['São Paulo', 'Rio de Janeiro', 'Belo Horizonte', 'Curitiba']}

In [27]:
# Responda Aqui
df = pd.DataFrame.from_dict(data)
print(df)

      Nome  Idade          Cidade
0    Alice     25       São Paulo
1      Bob     30  Rio de Janeiro
2  Charlie     35  Belo Horizonte
3    David     40        Curitiba

# Leia os dados de um CSV e aplique os métodos para inspecionar o DataFrame (typos de colunas, estatíscas descrivas, e o que mais sua imaginação quiser)

In [50]:
file_exemplo = "https://raw.githubusercontent.com/EduPekUfpr/MNUM-7124/main/Data/dados_pandas_exemplo.csv"

In [51]:
# Responda Aqui
df_workers = pd.read_csv(file_exemplo)
df_workers.head()

   ID   Nome  Idade  Salário Cargo
0   1  Alice     25     5000   E01
1   2    Bob     30     6000   G01
2   3  Carol     35     7000   G01
3   4  David     40     8000   G01
4   5  Emily     45     9000   G01

In [30]:
# Responda Aqui
df_workers[df_workers.ID.isin([5, 6, 7, 8, 9])]

   ID    Nome  Idade  Salário Cargo
4   5   Emily     45     9000   G01
5   6    Mary     38    10000   D01
6   7    Anna     52    12000   D01
7   8  Joseph     75    18000    VP
8   9    Caty     18     5000   E01

In [33]:
# Responda Aqui
df_workers.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 5 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   ID       9 non-null      int64
 1   Nome     9 non-null      object
 2   Idade    9 non-null      int64
 3   Salário  9 non-null      int64
 4   Cargo    9 non-null      object
dtypes: int64(3), object(2)
memory usage: 492.0+ bytes

In [35]:
# Visualizando estatísticas descritivas do DataFrame
print(df_workers.describe())

             ID      Idade       Salário
count  9.000000   9.000000      9.000000
mean   5.000000  39.777778   8888.888889
std    2.738613  16.701630   4136.557882
min    1.000000  18.000000   5000.000000
25%    3.000000  30.000000   6000.000000
50%    5.000000  38.000000   8000.000000
75%    7.000000  45.000000  10000.000000
max    9.000000  75.000000  18000.000000

In [37]:
# Verificando as colunas presentes no DataFrame
df_workers.columns

Index(['ID', 'Nome', 'Idade', 'Salário', 'Cargo'], dtype='object')

In [38]:
# Verificando o índice do DataFrame
df_workers.index

RangeIndex(start=0, stop=9, step=1)

## Indexação e Seleção de Dados

### Print o primeiro registro (linha)

In [52]:
# Responda Aqui
print(df_workers[['Nome', 'Idade', 'Salário', 'Cargo']].iloc[0])

Nome       Alice
Idade         25
Salário     5000
Cargo        E01
Name: 0, dtype: object

### Print todos os registros com idade acima de 30 anos

In [55]:
# Selecionando linhas com base em uma condição
# Responda Aqui
print(df_workers[df_workers['Idade'] > 30])

   ID    Nome  Idade  Salário Cargo
2   3   Carol     35     7000   G01
3   4   David     40     8000   G01
4   5   Emily     45     9000   G01
5   6    Mary     38    10000   D01
6   7    Anna     52    12000   D01
7   8  Joseph     75    18000    VP

### Print as 5 primeiras linhas, mas só as colunas 'Nome' e "Idade"

In [57]:
# Selecionando várias linhas e colunas pelo rótulo
print(df_workers.head(5)[['Nome', 'Idade']])

    Nome  Idade
0  Alice     25
1    Bob     30
2  Carol     35
3  David     40
4  Emily     45

### Print as 5 primeiras linhas, mas só as colunas de 0 a 2

In [65]:
# Selecionando várias linhas e colunas pela posição
print(df_workers.iloc[:5, :3])

   ID   Nome  Idade
0   1  Alice     25
1   2    Bob     30
2   3  Carol     35
3   4  David     40
4   5  Emily     45

### Troque o tipo da coluna cargo para categórico

In [69]:
# Responda Aqui
df_workers['Cargo'] = df_workers['Cargo'].astype('category')
df_workers.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 5 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   ID       9 non-null      int64
 1   Nome     9 non-null      object
 2   Idade    9 non-null      int64
 3   Salário  9 non-null      int64
 4   Cargo    9 non-null      category
dtypes: category(1), int64(3), object(1)
memory usage: 633.0+ bytes

## Identificar e Tratar Valores Ausentes

para as tarefas abaixo use o dicionário `data` para criar o seu DataFrame

In [94]:
# Exemplo de DataFrame com valores ausentes
data = {'A': [1, 2, None, 4, 5],
        'B': [1, None, 3.5, None, 5.7],
        'C': [1, 2, 3, 4, 5]}

# Responda Aqui
df = pd.DataFrame(data)
df

     A    B  C
0  1.0  1.0  1
1  2.0  NaN  2
2  NaN  3.5  3
3  4.0  NaN  4
4  5.0  5.7  5

### Mostre a quantidade de valores ausentes por coluna

In [76]:
# Verificando valores ausentes por coluna
df.isna().sum()

A    1
B    2
C    0
dtype: int64

# Existem várias maneiras de tratar valores ausentes, algumas delas são:

<font color='red'>CUIDADO para não alterar o DF original</font>


1. Remova linhas ou colunas com valores ausentes:

In [78]:
# Removendo todas as linhas com valores ausentes
df2 = df.copy()
df2.dropna(inplace=True)
df2

     A    B  C
0  1.0  1.0  1
4  5.0  5.7  5

In [79]:
# Removendo colunas com valores ausentes
df3 = df.copy()
df3.dropna(axis=1, inplace=True)
df3

   C
0  1
1  2
2  3
3  4
4  5

2. Preencher valores ausentes com um valor específico:

In [81]:
# Preenchendo valores ausentes com zero
df4 = df.copy()
df4.fillna(0, inplace=True)
df4

     A    B  C
0  1.0  1.0  1
1  2.0  0.0  2
2  0.0  3.5  3
3  4.0  0.0  4
4  5.0  5.7  5

In [84]:
# Preenchendo valores ausentes com a média da coluna
df5 = df.copy()

for col in df5.columns:
    media = df5[col].mean()
    df5[col] = df5[col].fillna(media)

df5

     A    B  C
0  1.0  1.0  1
1  2.0  3.4  2
2  3.0  3.5  3
3  4.0  3.4  4
4  5.0  5.7  5

3. Interpolar valores ausentes:

Tip: `interpolate()`

In [91]:
# Interpolando valores ausentes linearmente
df6 = df.copy()
df6.interpolate(method='linear', axis=0, inplace=True)
df6

     A     B  C
0  1.0  1.00  1
1  2.0  2.25  2
2  3.0  3.50  3
3  4.0  4.60  4
4  5.0  5.70  5

In [96]:
# Interpolando valores ausentes com grau 2
df7 = df.copy()
df7.interpolate(method='polynomial', order=2, axis=0, inplace=True)
df7

     A       B  C
0  1.0  1.0000  1
1  2.0  2.2875  2
2  3.0  3.5000  3
3  4.0  4.6375  4
4  5.0  5.7000  5

## Autores

<a href="https://www.linkedin.com/in/eduardopecora/" target="_blank">Eduardo Pecora</a>

## Log de modificações

| Data | Versão | Modificado por | Descrição |
| -----------| ------- | ---------- | ---------------------------------- |
| 04-03-2023       | 1.0     | Eduardo Pecora    | Inicial               |